Repository: mohammedalani1991/QS-Rank
Catalog: Core6NewsTemplate1/Resources/Views/CauseCategories/Index.*.resx
Languages: ar

source: About Us
ar: عن المنظمة

source: Beneficiaries
ar: المستفيدون

source: Contact Us
ar: تواصل معنا

source: Donate Now
ar: تبرع الان

source: Email
ar: البريد الالكتروني

source: Employees
ar: الموظفون

source: Our Projects
ar: مشاريعنا

source: Know More
ar: اعرف المزيد

source: KnowMore
ar: اعرف اكثر

source: Opended Projects
ar: المشاريع المفتوحة

source: Our Services
ar: خدمات المنظمة

source: Our Team
ar: فريقنا

source: Projects
ar: مشاريع

source: Services
ar: ماذا نقدم

source: String
ar: Know More

source: Suggested Researchers
ar: باحثون مقترحون

source: Testimonial
ar: المؤسسات الشريكة

source: Thanks For The Results Achieved With You
ar: شكراً للنتيجة التي استطعنا الوصول اليها بمساعدتكم

source: Namir Ali Hussain, The President
ar: نمير علي حسين ، رئيس المنظمة

source: Top News
ar: اخر الاخبار

source: Top News (View All)
ar: اخر الاخبار (مشاهدة الكل )

source: Trusted By Thousands organizations
ar: موثوقة من قبل آلاف المنظمات

source: Volunteers
ar: المُستفيدون

source: Your Name
ar: اسمك

source: Statistics
ar: احصائيات

source: Donners
ar: الداعمين

source: Our:
ar: منظمة بدار:

source: Partners
ar: الشركاء

source: Categories
ar: الاقسام

source: See All
ar: مشاهدة الكل
